[Main]
Abort=Abort
About=About
Add=Add
Address=Address
AddressNotFound=Address "%.8x" not found
AddressUsedByProcedure=Address is used by procedure "%s"
AddWatermark=New watermark
All=All
AllFiles=All files
AllProcedures=All procedures
AutoSaveProject=Autosave project after compilation
Back=Back
Best=Best (slow unpacking)
BreakAddress=End of procedure
Calculate=Calculate
Calculator=Calculator
Calls=Calls of procedures
Cancel=Cancel
ClearHistory=Clear history
Close=Close
CloseFolders=Collapse all folders
CodeSectionNotFound=Section "CODE" not found
CommandNotSupport=Command not supported
Commands=Commands
CommandsWithConditions=Commands with internal conditions
CompilationType=Compilation type
Compile=Compilation
Compiled=Compilation complete
CompilerMessages=Compiler messages
ConditionalJumps=Conditional jumps
Confirm=Confirm
Contents=Contents
Continue=Continue
Copy=Copy
Count=Count
CreateFileError=Cannot create file "%s"
CryptValues=Hide constants
Cut=Cut
Debug=Debug mode (search of external addresses)
Debugger=Debugger
DecreaseIsSpeed=decrease in speed
Del=Delete
Delete=Delete
Deleting=Deleting
DelFolder=Delete folder
DelProcedure=Delete procedure
DelWatermark=Delete watermark
Demo=Demo version
DemoLimit=In unregistered version it is possible to protect only one procedure
Detection=Detection
Direction=Direction
Directories=Directories
DoFind=Find
Down=Down
DragFileToOpen=Drag a file here to open
Dump=Dump
DynamicOnlineCommands=Dynamic creation of online commands
Edit=Edit
EditFolder=Edit folder
EditProcedure=Edit procedure
EditWatermark=Edit watermark
EmptyCompile=There are no data for compilation
EmptyFileName=Name of a file is not specified
EmptyModule=Module is not specified
EmptyProcess=Process is not specified
EnabledForUse=Enabled for use
EncryptRegisters=Encrypt registers on exit of VM
Error=Error
Execute=Execute
ExecutedFiles=Executable files
Exit=Exit
Expert=Expert
Export=Export
ExtAddress=External address
ExternalAdresses=External addresses
Fast=Fast (fast unpacking)
File=File
FileInfo=File info
FileIsNotDLL=File "%s" is not x%d DLL
FileName=File name
FileOffset=File offset
FilePacked=Probably the file "%s" is packed.Do you want to open it anyway?
FileUnknownFormat=File "%s" has a unknown format
Find=Find
FindNext=Find next
Flags=Flags
FoundUnpairedMarkers=Found %d unpaired markers
Generate=Generate
Goto=Go to address
Help=Help
Hint=Hint
HomePage=Home page
Ignore=Ignore
Import=Import
ImportProtection=Import protection
IncludeInCompilation=Include in compilation
Information=Information
InvalidAddress=Invalid address
InvalidCPUType=Processor "%s" is not supported
InvalidFormat=File "%s" has an incorrect %s format
InvalidKeyID=Invalid key identifier
InvalidOSType=Operational system "%s" is not supported
JmpOnExternalAddress=Jump to the external address: %.8x
JmpOnInternalAddress=Jump to the internal address: %.8x
JumpOnCommandPart=Jump on a part of a command
Jumps=Jumps
Key=Key
KeyIdentifier=Key identifier
Language=Language
Legend=Legend
Level=Level
License=License
LicenseNumber=License number
LicenseOptions=Set following licensing options for all procedures
LicenseDataNotFound=The license data not found in the file "%s"
LicensingParameters=Licensing parameters
LicensingSystemNotSupport=The licensing system not supported in this version
Loading=Loading
LockToKey=Lock to key
LockToSerialNumber=Lock to serial number
MAPFileHaveIncorrectTimeStamp=MAP file have incorrect timestamp and can not be loaded
MasterKeyPassword=Master key password
MatchCase=Match case
MaxProtection=Maximum protection
MaxSpeed=Maximum speed
MemoryProtection=Memory protection
MinGateSize=Minimal size of procedure for compilation is 5 bytes
Module=Module
ModuleOpenError=Cannot open module "%s"
ModuleUnknownFormat=Module "%s" has a unknown format
MoveDown=Move down
MoveResourcesToEnd=Move resources to the end of file
MoveUp=Move up
Mutation=Mutation
Name=Name
New=New
NewFolder=New folder
NewObjects=New markers and strings
NewProcedure=New procedure
Next=Next
No=No
NoPlaceForGate=There is no place for creation of an adapter
NoToAll=No to all
NotUseLicense=Do not use license
OK=OK
OnlineCommands=Online commands
Open=Open
OpenFile=Open file
OpenFolders=Expand all folders
OpenNewFile=Open new file
OptionAvialable=Option "%s" not avialable in unregistered version
Options=Options
Ordinal=Ordinal
Other=Other
OutputFile=Output file
OutputFileSize=Output file size %d bytes (%d%%)
Packing=Packing
PackOutputFile=Pack the output file
Parameters=Parameters
Paste=Paste
Pointer=address of
Procedure=Procedure
ProcedureNotFoundInMAP=Procedure "%s" is not found in objects list
ProceduresForProtect=Procedures for protection
Process=Process
Project=Project
ProjectFile=Project file
ProjectFiles=Project files
PushOriginalAddress=Saving in a stack of the original address: %.8x
Redo=Redo
References=References
RegisteredTo=Registered to
RelativeAddress=Relative address
Resources=Resources
Retry=Retry
RunnerCRC=Check the integrity of VM objects
SaveProject=Save project
SaveProjectAs=Save project as
Script=Script
ScriptFile=Script file
ScriptMessages=Script messages
Search=Search
SearchInFile=Search in file
SearchInProcess=Search in process
Section=Section
SectionNotPacked=Section "%s" can not be packed
SectionPosUsedByDir=Directory "%s" is in the field of creation of heading of new section
SectionPosUsedBySection=Section "%s" is in the field of creation of heading of new section
Sections=Sections
SEHNotSupported=Processing of exceptions is not supported: %.8x
SelectAll=Select all
SelectProceduresForProtect=Select procedures for protection
Settings=Settings
Setup=Setup
ShellExt=Integrate into shell
ShowAll=Show all
Size=Size
SortByName=To sort the list of procedures by name?
SortByType=To sort the list of procedures by compilation type?
String=string
Strings=Strings
StringDeprecated=Use VMProtectDecryptStringA/VMProtectDecryptStringW to protect strings
StripFixups=Remove fixup elements (only for EXE files)
Text=Text
TextNotFound=Text "%s" not found
Thanks=Thanks
Toolbars=Toolbars
Tools=Tools
Type=Type
Ultra=Ultra (mutation + virtualization)
Undo=Undo
Unregistered=Unregistered version
Up=Up
Usage=Usage
UseLicense=Use license
UseProjectOptions=Use project options
UserPIN=User PIN
Value=Value
ValuesFor=Values for
Variable=variable
Version=Version
VersionNumber=Version number
View=View
Virtualization=Virtualization
VirtualMachines=Virtual Machines
VMSections=VM sections
VMTools=Virtualization tools (VMware/Virtual PC/Sandboxie)
Warning=Warning
WatermarkCount=In unregistered version it is possible to create only one watermark
WatermarkDisabled=Watermark "%s" disabled for use
WatermarkExist=Watermark "%s" already exist
WatermarkName=Watermark name
WatermarkNotFound=Watermark "%s" is not found in watermark list
Watermarks=Watermarks
WatermarkUsed=Watermark "%s" is used in protected files
Wizard=Wizard
Yes=Yes
YesToAll=Yes to all

[Manager]
About...=&About...
Contents...=&Contents...
Customers=&Customers
Edit=&Edit
File=&File
Help=&Help
New=&New
Open...=&Open...
Licenses=&Licenses
Products=&Products
Save=&Save
View=&View
AboutComment=Show "About" window
AboutTitle=About
AboutTooltip=About
ContentsComment=Show help contents
ContentsTooltip=Help Contents
AddCustomer=Add Customer
Address=Address
Blocked=License blocked
Cancel=Cancel
Change=Change
ChangeWindowPos=Change window position
ChangeWindowSize=Change window size
CloseWindow=Close window
Comments=Comments
Customer=Customer
CustomerProperties=Customer Properties
CustomerDetails=Customer Details
Date=Date
Delete=Delete
Discount=Discount
Exit=E&xit
EMail=E-Mail
Edit=Edit
ExitComment=Quit the application
LanguageWillBeChangedAtTheNextStart=Language will be changed next time when you run the application
MaximizeWindow=Maximize window
MinimizeWindow=Minimize window
NewCustomer=New Customer
NewDocComment=Create a new database
NewDocTooltip=New
NewLicense=New License
NewProduct=New Product
No=No
Yes=Yes
OK=OK
OpenDocComment=Open an existing database
OpenDocTooltip=Open
OpenMRU=Open this document
License=License
LicenseProperties=License Properties
LicenseDetails=LicenseDetails
Licenses by Customers=Licenses by C&ustomers
Licenses by Products=Licenses by P&roducts
Phone=Phone
Price=Price
ProductTitle=Product
ProductProperties=Product Parameters
ProductDetails=Product Details
Ready=Ready
Recent File=Recent File
Referrer=Referrer
RestoreWindow=Restore window size
Save As...=Save &As...
Save changes to %1?=Save changes to %1?
SaveAsDocComment=Save the active database with a new name
SaveDocComment=Save the active database
SaveDocTooltip=Save
SelectCustomer=Select Customer
SerialNumber=SerialNumber
Show Status Bar=Show &Status Bar
Show Toolbar=Show &Toolbar
ShowStatusbarComment=Show Status Bar
ShowToolbarComment=Show Toolbar
Site=Site
Title=Title
Version=Version

CustomerProperties=Customer Properties
LicenseProperties=License Properties
ProductProperties=Product Properties
Language=Language

EditObject=Properties...
DeleteObjectComment=Delete selected object
EditObjectComment=Display properties of the selected object
CustomersComment=Show customers
NewCustomerComment=Create new customer
NewLicenseComment=Create new license
NewProductComment=Create new product
LicensesByCustomersComment=Show licenses by customer
LicensesByProductComment=Show licenses by product
LicensesComment=Show licenses
ProductsComment=Show products

DeleteObjectTooltip=Delete object
EditObjectTooltip=Edit object
CustomersTooltip=Customers
NewCustomerTooltip=New customer
NewLicenseTooltip=New license
NewProductTooltip=New product
LicensesByCustomersTooltip=Licenses by customers
LicensesByProductTooltip=Licenses by products
LicensesTooltip=Licenses
ProductsTooltip=Products

UnableToOpenFile=Unable to open file "%s"\nFile corrupted or you dont' have access to it\n\nDetails of the error:\n%s.
UnableToSaveFile=Unable to save file "%s".\nMake sure that you have access to those location and that you have enough space on the disc.\n\nError code: %d.

OpenLastDocument=Auto Open The Last Document

Undo=Undo
UndoComment=Undo the last operation
UndoTooltip=Undo
Redo=Redo
RedoComment=Redo the last operation
RedoTooltip=Redo

DatabaseErrorDetails=%s\nError code: %d

SerialNumberAlgorithm=Algorithm
AlgorithmBits=Length of key
ProductNewKeyPair=You are about to generate a new key pair for this product.\nThis will break compatibility with any previously generated serial number for the product.\nYou need to protect your program again using the newly generated key.\n\nAre you sure you want to change the key?

Undefined=Undefined
SerialNumberWillBeGenerated=Serial number will be generated when you press OK button.
NeedToSelectCustomer=You have to select customer to create license.

Unknown=Unknown
LicenseSettingsFileFilter=VMProtect project
...=...
PathToSettingsFile=VMProtect project
NeedToSetTitle=You have to enter product title.

ExceptionFormatString=Unexpected error! Please send this error to the developers.\nYou can copy the text by pressing Ctrl+C.\n\nException type: %s\nPlace: %s\nError details:\n%s

UnableToSaveSettingsFile=Unable to save settings file for VMProtect\nPlease make sure that the following path is valid and you have access rights to write there.\nFile: %s\nError code: %d


CustomerName=Customer Name
DatabaseLicenseData=License Details
SerialNumberLicenseData=Serial Number Content
Block=Block Serial Number
Unblock=Unblock Serial Number
CopySerialNumber=Copy Serial Number
OrderRef=Order #
HardwareID=Hardware ID
ExpDate=Expiration Date
RunningTimeLimit=Running Time Limit
UserData=User Data
ShowLicenses=Show Licenses
(minutes)=(minutes)
SerialNumberData=Serial number data (bytes used: %d of %d)
NewLicenseFieldIsTooLong=Field "%s" is too long: %d bytes.\nMaximal number of bytes allowed: %d (in UTF-8 encoding).
InvalidHardwareId=Hardware ID is invalid or empty.
SerialNumberDataIsTooLong=There is not enough space for data in the serial number.\nMaximal number of bytes allowed: %d, you used: %d.
UserDataIsTooLong=There is not enough space for data in the "User Data" field.\nMaximal number of bytes allowed: %d, you used: %d.

FindLicense=Find license
FindLicenseComment=Find License
FindLicenseTooltip=Find License
ImportLicense=Import license
ImportLicenseComment=Import License
ImportLicenseTooltip=Import License
PasteSerialNumber=Enter serial number:
FindLicenseCantFindSerialNumber=Can't find such serial number in the database.\nIt doesn't match any of the products.
FindLicenseDoYouWantToImport=This serial number is for product "%s".\nDo you want to import it to the database?
ImportSerialNumberAlreadyExist=This serial number already exists in the database.\nYou can't import it again.
ImportLicenseInvalidSerialNumber=This serial number doesn't match any of the products in database.

Untitled=Untitled
VMPLMDocument=License Manager Database
VMPLicenseManager=VMProtect License Manager
Filter=Filter:

ProductCode=Product code
MaxBuildDate=Max Build Date

ExportKeyPair=Export Key Pair
ProductKeyChangedCommitFirst=It seems that you just changed parameters of the key.\nTo prevent incorrect export, please commit your changes first by pressing the "OK" button in the product properties window.
Close=Close
KeyPairExportTarget=Export format:
KeyPairExportResult=Results of export:
ExportForKeyGenDll=KeyGen.dll parameters (MSVC)
ExportForKeyGenDll_PAS=KeyGen.dll parameters (Delphi)
ExportForKeyGenPHP=keygen.php parameters
ExportForKeyGenNet=KeyGen.Net parameters
Copy=Copy

FilterBox=Change filter
FilterBoxComment=Change filter
FilterBoxTooltop=Change filter
FilterCueBanner=Filter

HardwareId_Part_CPU=CPU
HardwareId_Part_Host=Host
HardwareId_Part_Mac=Ethernet
HardwareId_Part_HDD=HDD
HWIDParser=Hardware Id Details
HWIDParser_Column_Type=Device
HWIDParser_Column_Value=Identifier
DoYouWantToCreateCustomerByLicense=Serial number contains information about customer, but there is no such customer in the database.\nDo you want to create one?

AboutHome=Home
AboutEMail=E-Mail
AboutWarning=Warning: This computer program is protected by copyright law and international treaties. Unauthorized reproduction or distribution of this program, or any portion of it, may result in severe civil and criminal penalties, and will be prosecuted under the maximum extent possible under law.

NoHelpFile=Unable to open help file